1. rename() Function:

In [63]:
import pandas as pd

In [64]:
data = {'ID': [101, 102, 103],
'FName': ['John', 'Alice', 'Bob'],
'LName': ['Doe', 'Smith', 'Brown']}

In [65]:
df = pd.DataFrame(data)
print(df)

    ID  FName  LName
0  101   John    Doe
1  102  Alice  Smith
2  103    Bob  Brown

In [66]:
df.rename(columns={'FName':'First_Name','LName':'Last_name'})

    ID First_Name Last_name
0  101       John       Doe
1  102      Alice     Smith
2  103        Bob     Brown

Write a script using `iterrows()` to print each row where the price is greater than 500.

In [67]:
data = {'Product': ['Laptop', 'Phone', 'Tablet'],
'Price': [800, 500, 300]}

df = pd.DataFrame(data)
df

  Product  Price
0  Laptop    800
1   Phone    500
2  Tablet    300

In [68]:
for i,j in df.iterrows():
    if j['Price']>500:
        print("product:",j['Product'])
        print("price:",j['Price'])

product: Laptop
price: 800

Use the `info()` function to check the data types and missing values in the DataFrame.

In [69]:
data = {'Name': ['Alex', 'Blake', 'Casey', None],
'Age': [25, 30, 28, 22],
'Salary': [50000, None, 60000, 45000]}

df = pd.DataFrame(data)
df

    Name  Age   Salary
0   Alex   25  50000.0
1  Blake   30      NaN
2  Casey   28  60000.0
3   None   22  45000.0

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     4 non-null      int64
 2   Salary  3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 228.0+ bytes

describe() Function:
Given the following DataFrame:

data = {'Marks': [88, 92, 79, 85, 90, 78, 95, 88]}

df = pd.DataFrame(data)

Use `describe()` to get statistical information about the `Marks` column.

In [71]:
data = {'Marks': [88, 92, 79, 85, 90, 78, 95, 88]}

df = pd.DataFrame(data)
df

   Marks
0     88
1     92
2     79
3     85
4     90
5     78
6     95
7     88

In [72]:
df.describe()

           Marks
count   8.000000
mean   86.875000
std     5.962682
min    78.000000
25%    83.500000
50%    88.000000
75%    90.500000
max    95.000000

values Attribute:
Given the following DataFrame:

Extract all values from the DataFrame as a NumPy array using `.values`.

In [73]:
data = {'City': ['New York', 'Los Angeles', 'Chicago'],
'Population': [8419600, 3980400, 2716000]}

df = pd.DataFrame(data)
df

          City  Population
0     New York     8419600
1  Los Angeles     3980400
2      Chicago     2716000

In [74]:
df.values

array([['New York', 8419600],
       ['Los Angeles', 3980400],
       ['Chicago', 2716000]], dtype=object)

insert() Function:
Given the following DataFrame:
Insert a new column named `Gender` at the second position with values ` ['F', 'M', 'M']`.

In [75]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
'Age': [25, 30, 35]}

df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [76]:
df.insert(2,'Gender',['F', 'M', 'M'])
df

      Name  Age Gender
0    Alice   25      F
1      Bob   30      M
2  Charlie   35      M